export const federalDistricts: string[] = [
  'Центральный федеральный округ',
  'Северо-Западный федеральный округ',
  'Южный федеральный округ',
  'Северо-Кавказский Федеральный округ',
  'Приволжский федеральный округ',
  'Уральский федеральный округ',
  'Сибирский федеральный округ',
  'Дальневосточный федеральный округ'
];

export const federalSubjects: Map<string, string[]> = new Map(
  [
    ['Центральный федеральный округ',
      [
        'Белгородская область',
        'Брянская область',
        'Владимирская область',
        'Воронежская область',
        'Ивановская область',
        'Калужская область',
        'Костромская область',
        'Курская область',
        'Липецкая область',
        'Московская область',
        'Орловская область',
        'Рязанская область',
        'Смоленская область',
        'Тамбовская область',
        'Тверская область',
        'Тульская область',
        'Ярославская область',
        'Москва'
      ]
    ],
    ['Северо-Западный федеральный округ',
      [
        'Республика Карелия',
        'Республика Коми',
        'Архангельская область',
        'Вологодская область',
        'Калининградская область',
        'Ленинградская область',
        'Мурманская область',
        'Новгородская область',
        'Псковская область',
        'Санкт-Петербург',
        'Ненецкий автономный округ'
      ]
    ],
    ['Южный федеральный округ',
      [
        'Республика Адыгея',
        'Республика Калмыкия',
        'Республика Крым',
        'Краснодарский край',
        'Астраханская область',
        'Волгоградская область',
        'Ростовская область',
        'Севастополь'
      ]
    ],
    ['Северо-Кавказский Федеральный округ',
      [
        'Республика Дагестан',
        'Республика Ингушетия',
        'Кабардино-Балкарская Республика',
        'Карачаево-Черкесская Республика',
        'Северная Осетия — Алания',
        'Чеченская Республика',
        'Ставропольский край'
      ]
    ],
    ['Приволжский федеральный округ',
      [
        'Республика Башкортостан',
        'Республика Марий Эл',
        'Республика Мордовия',
        'Республика Татарстан',
        'Удмуртская Республика',
        'Чувашская Республика',
        'Пермский край',
        'Кировская область',
        'Нижегородская область',
        'Оренбургская область',
        'Пензенская область',
        'Самарская область',
        'Саратовская область',
        'Ульяновская область'
      ]
    ],
    ['Уральский федеральный округ',
      [
        'Курганская область',
        'Свердловская область',
        'Тюменская область',
        'Челябинская область',
        'Ханты-Мансийский автономный округ — Югра',
        'Ямало-Ненецкий автономный округ'
      ]
    ],
    ['Сибирский федеральный округ',
      [
        'Республика Алтай',
        'Республика Тыва',
        'Республика Хакасия',
        'Алтайский край',
        'Красноярский край',
        'Иркутская область',
        'Кемеровская область — Кузбасс',
        'Новосибирская область',
        'Омская область',
        'Томская область'
      ]
    ],
    ['Дальневосточный федеральный округ',
      [
        'Республика Бурятия',
        'Республика Саха (Якутия)',
        'Забайкальский край',
        'Камчатский край',
        'Приморский край',
        'Хабаровский край',
        'Амурская область',
        'Магаданская область',
        'Сахалинская область',
        'Еврейская автономная область',
        'Чукотский автономный округ'
      ]
    ]
  ]
);


