export const federalDistricts: string[] = [
  'Центральный федеральный округ',
  'Северо-Западный федеральный округ',
  'Южный федеральный округ',
  'Северо-Кавказский Федеральный округ',
  'Приволжский федеральный округ',
  'Уральский федеральный округ',
  'Сибирский федеральный округ',
  'Дальневосточный федеральный округ'
];

export const federalSubjects: Map<string, string[]> = new Map(
  [
    ['Центральный федеральный округ',
      [
        'Белгородская область',
        'Брянская область',
        'Воронежская область',
        'Калужская область',
        'Костромская область',
        'Курская область',
        'Липецкая область',
        'Орловская область',
        'Рязанская область',
        'Смоленская область',
        'Тамбовская область',
        'Тверская область',
        'Тульская область',
        'Владимирская область',
        'Ивановская область',
        'Ярославская область'
      ]
    ],
    ['Северо-Западный федеральный округ',
      [
        'Ленинградская область',
        'Республика Коми',
        'Вологодская область',
        'Ненецкий автономный округ',
        'Псковская область',
        'Новгородская область',
        'Мурманская область',
        'Калининградская область',
        'Архангельская область',
        'Республика Карелия'
      ]
    ],
    ['Южный федеральный округ',
      [
        'Республика Калмыкия',
        'Краснодарский край',
        'Астраханская область',
        'Ростовская область',
        'Волгоградская область',
        'Республика Адыгея'
      ]
    ],
    ['Северо-Кавказский Федеральный округ',
      [
        'Чеченская Республика',
        'Ставропольский край',
        'Карачаево-Черкесская Республика',
        'Кабардино­-Балкарская Республика',
        'Республика Северная Осетия – Алания',
        'Республика Ингушетия',
        'Республика Дагестан'
      ]
    ],
    ['Приволжский федеральный округ',
      [
        'Нижегородская область',
        'Республика Татарстан',
        'Кировская область',
        'Пермский край',
        'Самарская область',
        'Оренбургская область',
        'Республика Башкортостан',
        'Ульяновская область',
        'Удмуртская Республика',
        'Республика Марий Эл',
        'Республика Мордовия',
        'Чувашская Республика',
        'Пензенская область',
        'Саратовская область'
      ]
    ],
    ['Уральский федеральный округ',
      [
        'Свердловская область',
        'Курганская область',
        'Тюменская область',
        'Ханты-Мансийский автономный округ - Югра',
        'Челябинская область',
        'Ямало-Ненецкий АО'
      ]
    ],
    ['Сибирский федеральный округ',
      [
        'Алтайский край',
        'Кемеровская область - Кузбасс',
        'Республика Алтай',
        'Республика Тыва',
        'Красноярский край',
        'Иркутская область',
        'Новосибирская область',
        'Республика Хакасия',
        'Омская область',
        'Томская область'
      ]
    ],
    ['Дальневосточный федеральный округ',
      [
        'Забайкальский край',
        'Еврейская автономная область',
        'Республика Саха (Якутия)',
        'Камчатский край',
        'Приморский край',
        'Хабаровский край',
        'Амурская область',
        'Магаданская область',
        'Сахалинская область',
        'Республика Бурятия',
        'Чукотский автономный округ'
      ]
    ]
  ]
);


